huigg296/servo-control-course/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief UART 1 transmit data source select: UART1_TX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u
/*!
 * @brief FTM0 channel 0 output source: FTM0_CH0 pin is output of FTM0 channel 0 output */
#define SOPT8_FTM0OCH0SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 1 output source: FTM0_CH1 pin is output of FTM0 channel 1 output */
#define SOPT8_FTM0OCH1SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 2 output source: FTM0_CH2 pin is output of FTM0 channel 2 output */
#define SOPT8_FTM0OCH2SRC_FTM 0x00u
/*!
 * @brief FTM0 channel 3 output source: FTM0_CH3 pin is output of FTM0 channel 3 output */
#define SOPT8_FTM0OCH3SRC_FTM 0x00u

/*! @name PORTA4 (number 21), S2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S2_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S2_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTB0 (number 27), PHA1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHA1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHA1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHA1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB1 (number 28), PHB1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHB1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHB1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHB1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB2 (number 29), S8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S8_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S8_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S8_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S8_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S8_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTB3 (number 30), S3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S3_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTB16 (number 31), S7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S7_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S7_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S7_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S7_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S7_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB17 (number 32), BUZZ
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BUZZ_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BUZZ_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BUZZ_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BUZZ_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BUZZ_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC0 (number 33), LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC1 (number 34), IS2
  @{ */

