huigg296/servo-control-course/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IS2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IS2_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IS2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IS2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IS2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC2 (number 35), S9
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S9_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S9_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S9_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S9_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S9_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC3 (number 36), UART1_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART1_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART1_RX_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART1_RX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC4 (number 37), UART1_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART1_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART1_TX_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART1_TX_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC5 (number 38), EN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EN2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EN2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_EN2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EN2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EN2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC6 (number 39), IS1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IS1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_IS1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_IS1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_IS1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_IS1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC7 (number 40), EN1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EN1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EN1_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_EN1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EN1_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EN1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTD0 (number 41), PWM0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWM0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWM0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWM0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD1 (number 42), PWM1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWM1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWM1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWM1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD2 (number 43), PWM2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWM2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWM2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWM2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD3 (number 44), PWM3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWM3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWM3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWM3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD4 (number 45), PHB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PHB_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PHB_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHB_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHB_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTD5 (number 46), PHA
  @{ */

