huigg296/servo-control-course/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PHA_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PHA_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHA_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHA_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHA_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTD6 (number 47), PUSH
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PUSH_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PUSH_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PUSH_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PUSH_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PUSH_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD7 (number 48), S5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S5_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S5_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE16 (number 3), PE16
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PE16_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PE16_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PE16_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PE16_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PE16_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE17 (number 4), PE17
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PE17_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PE17_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PE17_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PE17_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PE17_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE18 (number 5), PE18
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PE18_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PE18_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PE18_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PE18_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PE18_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE19 (number 6), PE19
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PE19_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PE19_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PE19_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PE19_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PE19_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE24 (number 15), PE24
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PE24_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PE24_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PE24_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PE24_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PE24_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE25 (number 16), S4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S4_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S4_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S4_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name ADC0_DP0 (number 7), ADCDP
  @{ */
/* @} */

/*! @name ADC0_DM0 (number 8), ADCDM
  @{ */
/* @} */

/*! @name VREF_OUT (number 13), VREF
  @{ */
/* @} */

/*! @name DAC0_OUT (number 14), VOUT
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
